Revit 2027 API
ExportLayerKey.SpecialType Property
 The special type for layer key.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpecialType SpecialType { get; set; }
Public Property SpecialType As SpecialType
	Get
	Set
public:
property SpecialType SpecialType {
	SpecialType get ();
	void set (SpecialType value);
}
member SpecialType : SpecialType with get, set
Property Value
SpecialType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportLayerKey Class
Autodesk.Revit.DB Namespace